Revit 2027 API
BuiltInFailures.SystemsFailures.PastePartsWithInvalidService Property
 Parts were not pasted because fabrication configuration is not available or service is not valid in the type properties for the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PastePartsWithInvalidService { get; }
Public Shared ReadOnly Property PastePartsWithInvalidService As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PastePartsWithInvalidService {
	FailureDefinitionId^ get ();
}
static member PastePartsWithInvalidService : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SystemsFailures Class
Autodesk.Revit.DB Namespace